# PathReinEndHookOrient2Wall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathReinEndHookOrient2Wall Property
ParameterTypeId Class See Also
---
"Alternating Bar - End Hook Orientation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathReinEndHookOrient2Wall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinEndHookOrient2Wall As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathReinEndHookOrient2Wall {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace